# 局面をセットした配列を返す関数ファイル

# 平手をセットする関数
# 戻り値：
# 平手をセットした配列
"""
^:先手
v:後手
W:壁（侵入できない場所）
"""
def arrStartpos():
  arr_temp = [
    ["W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ],
    ["W" ,"Lv","Nv","Sv","Gv","Kv","Gv","Sv","Nv","Lv","W" ],
    ["W" ,""  ,"Rv",""  ,""  ,""  ,""  ,""  ,"Bv",""  ,"W" ],
    ["W" ,"Pv","Pv","Pv","Pv","Pv","Pv","Pv","Pv","Pv","W" ],
    ["W" ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,"W" ],
    ["W" ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,"W" ],
    ["W" ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,""  ,"W" ],
    ["W" ,"P^","P^","P^","P^","P^","P^","P^","P^","P^","W" ],
    ["W" ,""  ,"B^",""  ,""  ,""  ,""  ,""  ,"R^",""  ,"W" ],
    ["W" ,"L^","N^","S^","G^","K^","G^","S^","N^","L^","W" ],
    ["W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ,"W" ]
  ]
  return arr_temp
